# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [10]:
s1 = pd.Series(np.random.randint(1, 5, size=100))
s2 = pd.Series(np.random.randint(1, 4, size=100))
s3 = pd.Series(np.random.randint(10000, 30000, size=100))
s1

0     2
1     2
2     2
3     1
4     4
     ..
95    3
96    2
97    3
98    3
99    4
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   0  1      2
0  4  3  13976
1  1  2  25822
2  2  3  24597
3  3  1  20233
4  2  1  27820

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df = df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'})
df.head()

   bedrs  bathrs  price_sqr_meter
0      4       3            13976
1      1       2            25822
2      2       3            24597
3      3       1            20233
4      2       1            27820

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
df_one_col = pd.concat([s1, s2, s3]).to_frame()
df_one_col.columns = ['bigcolumn']
df_one_col.head()

   bigcolumn
0          4
1          1
2          2
3          3
4          2

In [6]:
type(df_one_col)

pandas.core.frame.DataFrame

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [7]:
df_one_col.tail()

    bigcolumn
95      22152
96      23763
97      19629
98      12301
99      10582

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
df_one_col.reset_index(drop=True, inplace=True)

In [9]:
df_one_col

     bigcolumn
0            4
1            1
2            2
3            3
4            2
..         ...
295      22152
296      23763
297      19629
298      12301
299      10582

[300 rows x 1 columns]